---
kind: type
id: T:Autodesk.Revit.DB.MEPSystemClassification
source: html/43ec0d75-d6bb-2d08-a920-9715e83040e7.htm
---
# Autodesk.Revit.DB.MEPSystemClassification

This enumeration is used to classify MEP connectors and systems
 and drives certain behavior for a particular system type

## Syntax (C#)
```csharp
public enum MEPSystemClassification
```